Autodesk.Revit.DB.PlanarFace.Vector(System.Int32)
Defining vectors of the surface.

Autodesk.Revit.DB.PlanarFace.Normal
Normal of the surface.
Remarks: This property is the "surface normal" vector.  This is not necessarily the normal vector pointing out of the
solid that contains the face, to get that value use Autodesk.Revit.DB.Face.ComputeNormal(Autodesk.Revit.DB.UV).

Autodesk.Revit.DB.PlanarFace
A planar face of a 3d solid.
Remarks: Planar faces are defined by planes bounded by edge loops.
The planes provide natural UV parameterization to the faces.
S(u, v) = Origin + u*Vector[0] + v*Vector[1]